/*Упражнение 2.34. Напишите программу, содержащую переменные и
присвоения из предыдущего упражнения. Выведите значения переменных
до и после присвоений, чтобы проверить правильность предположений в
предыдущем упражнении. Если они неправильны, изучите примеры еще
раз и выясните, что привело к неправильному заключению.*/ 
#include<iostream>
int main(){
    int i = 0, &r = i;
    auto a = r; // a - int (r - псевдоним для i,имеющий тип int)
    const int ci = i, &cr = ci;
    auto b = ci; // b - int (const верхнего уровня вci отброшен)
    auto c = cr; // с - int (cr - псевдоним для ci с const верхнего уровня)
    auto d = &i; // d - int* (& объекта int - int*)
    auto e = &ci; // e - const int* (& константного объекта - const нижнего уровня)
    const auto f = ci; // выведенный тип ci - int; тип f - const int
    auto &g = ci; // g - const int&, связанный с ci
    std::cout<<" a: "<< a <<std::endl;
    std::cout<<" b: "<< b <<std::endl;
    std::cout<<" c: "<< c << std::endl;
    std:: cout<<" d: "<< *d <<std::endl;// без * выводиться адрес памяти, а не ее значение 
    std::cout<<" e: "<< *e << std::endl;
    std::cout<<" g: "<< g << std::endl;
    a=42;
    b=42;
    c=42;
    *d=42;
//*e=42; не работает тк е это указатель на константу, нельзя изменять значение на которое он указывает
//g=42; не рботает тк это ссылка на константу 
    std::cout<< " New: "<<std::endl;
    std::cout<<" a: "<< a <<std::endl;
    std::cout<<" b: "<< b <<std::endl;
    std::cout<<" c: "<< c << std::endl;
    std:: cout<<" d: "<< *d <<std::endl;// без * выводиться адрес памяти, а не ее значение 
    return 0;
}