/*Упражнение 2.8. Напишите программу, использующую управляющие
последовательности для вывода значения 2M, сопровождаемого новой
строкой. Модифицируйте программу так, чтобы вывести 2, затем
табуляцию, потом M и наконец символ новой строки.*/
#include<iostream>
int main(){
    std::cout<<"2\x4d\n"<<std::endl;
    std::cout<<"2\t\x4d\n"<<std::endl;
    return 0;
}