/*Упражнение 5.17. Предположим, есть два вектора целых чисел.
Напишите программу, определяющую, не является ли один вектор
префиксом другого. Для векторов неравной длины сравнивайте количество
элементов меньшего вектора. Например, если векторы содержат значения
0, 1, 1, 2 и 0, 1, 1, 2, 3, 5, 8 соответственно, ваша
программа должна возвратить true.*/
#include <iostream>
#include <vector> 
using namespace std;
int main() {
    vector<int> v1={0,1,1,2} ;
    vector<int> v2={0,1,1,2,3,5,8};
    int t=0;
    size_t minSize = (v1.size() < v2.size()) ? v1.size() : v2.size();
    for( int i=0;i!=minSize;i++)
    {
        if(v1[i]==v2[i])
        ++t;
        else
        break;
    }
    if(t==minSize)
    cout<<"true";
    return 0;
}